#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.cloudresourcemanager: Refreshing state... [id=de-challengue-test/cloudresourcemanager.googleapis.com]
google_project_service.project["cloudfunctions.googleapis.com"]: Refreshing state... [id=de-challengue-test/cloudfunctions.googleapis.com]
google_project_service.project["storage-component.googleapis.com"]: Refreshing state... [id=de-challengue-test/storage-component.googleapis.com]
google_project_service.project["container.googleapis.com"]: Refreshing state... [id=de-challengue-test/container.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=de-challengue-test/compute.googleapis.com]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=de-challengue-test/iam.googleapis.com]
google_project_service.project["cloudbuild.googleapis.com"]: Refreshing state... [id=de-challengue-test/cloudbuild.googleapis.com]
google_project_service.project["bigquery.googleapis.com"]: Refreshing state... [id=de-challengue-test/bigquery.googleapis.com]
google_project_service.project["iamcredentials.googleapis.com"]: Refreshing state... [id=de-challengue-test/iamcredentials.googleapis.com]
google_project_service.project["datastudio.googleapis.com"]: Refreshing state... [id=de-challengue-test/datastudio.googleapis.com]
google_project_service.project["appengine.googleapis.com"]: Refreshing state... [id=de-challengue-test/appengine.googleapis.com]
google_project_service.project["dataflow.googleapis.com"]: Refreshing state... [id=de-challengue-test/dataflow.googleapis.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_pubsub_topic.ldn_arrive_topic will be created
  + resource "google_pubsub_topic" "ldn_arrive_topic" {
      + id      = (known after apply)
      + name    = "metascore-lnd-notification"
      + project = "de-challengue-test"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic_iam_binding.ldn_arrive_binding will be created
  + resource "google_pubsub_topic_iam_binding" "ldn_arrive_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:service-935901401525@gs-project-accounts.iam.gserviceaccount.com",
        ]
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = "metascore-lnd-notification"
    }

  # google_storage_notification.object_landing_notification will be created
  + resource "google_storage_notification" "object_landing_notification" {
      + bucket          = "de-challengue-test-metascore-lnd"
      + event_types     = [
          + "OBJECT_FINALIZE",
        ]
      + id              = (known after apply)
      + notification_id = (known after apply)
      + payload_format  = "JSON_API_V1"
      + self_link       = (known after apply)
      + topic           = "metascore-lnd-notification"
    }

  # module.analytics-bucket-metascore.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "de-challengue-test-metascore-analytics"
      + project                     = "de-challengue-test"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-analytics"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-analytics"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-analytics"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahidale.zg@gmail.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-analytics"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectViewer"
    }

  # module.analytics_dataset["consumption"].google_bigquery_dataset.main will be created
  + resource "google_bigquery_dataset" "main" {
      + creation_time              = (known after apply)
      + dataset_id                 = "consumption"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + project                    = "de-challengue-test"
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.analytics_dataset["staging"].google_bigquery_dataset.main will be created
  + resource "google_bigquery_dataset" "main" {
      + creation_time              = (known after apply)
      + dataset_id                 = "staging"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + project                    = "de-challengue-test"
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.analytics_dataset_data_editor["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Gustavo.Aguilar0@walmart.com"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataEditor"
    }

  # module.analytics_dataset_data_editor["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Mariano.Gonzalez0@walmart.com"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataEditor"
    }

  # module.analytics_dataset_data_editor["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Gustavo.Aguilar0@walmart.com"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataEditor"
    }

  # module.analytics_dataset_data_editor["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Mariano.Gonzalez0@walmart.com"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataEditor"
    }

  # module.analytics_dataset_data_owner["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahidale.zg@gmail.com"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataOwner"
    }

  # module.analytics_dataset_data_owner["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahidale.zg@gmail.com"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataOwner"
    }

  # module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahid.galea@wom.cl"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahid.galea@wom.cl"
      + project    = "de-challengue-test"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.landing-bucket-metascore.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "de-challengue-test-metascore-lnd"
      + project                     = "de-challengue-test"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahidale.zg@gmail.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectViewer"
    }

  # module.raw-bucket-metascore.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "de-challengue-test-metascore-raw"
      + project                     = "de-challengue-test"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahidale.zg@gmail.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectViewer"
    }

Plan: 28 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ZahidGalea, Action: `pull_request`, Working Directory: `infraestructure/terraform/de-challenge-test`, Workflow: `Terraform Planning`*